app/Models/DataDocReward.php

INSERT INTO `doc_reward` (`id`, `nik`, `claim_id`, `reward_id`, `created_at`, `updated_at`) VALUES ('040120231251151804012023010149', '181795', '0401202312511518', '04012023125115', '2023-04-01 13:01:49', '2023-04-01 13:01:49')
---
    public function insertData($datasimpan)
    {
       return $this->insert($datasimpan);